tutorials/single_phase_elastic/twoStep/pillarsSnappySolids/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          739;
        startFace       59833;
    }
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       60572;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       60662;
    }
    emptyFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          60878;
        startFace       60752;
    }
    geometry
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2493;
        startFace       121630;
    }
)

// ************************************************************************* //
